Date and time: 2019-12-06 10-28-15

LOG: True
AUG: False
CLASSIFICATION CLASSES: 4
SEGMENTATION CLASSES: 3
INPUT SHAPE: (320, 640, 3)
BACKBONE: resnet50
RANDOM STATE: 28
BATCH SIZE: 12

alternative
direct
alternative
alternative
Images dtype: uint8
Labels dtype: uint8

Images shape: (320, 640, 3)
Labels shape: (320, 640)

Train:Val split = 0.9:0.1

Training files count: 62876
Validation files count: 6987

Loading model weights: 2019-12-05 16-25-45
Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
data (InputLayer)               (None, 320, 640, 3)  0                                            
__________________________________________________________________________________________________
bn_data (BatchNormalization)    (None, 320, 640, 3)  9           data[0][0]                       
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 326, 646, 3)  0           bn_data[0][0]                    
__________________________________________________________________________________________________
conv0 (Conv2D)                  (None, 160, 320, 64) 9408        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
bn0 (BatchNormalization)        (None, 160, 320, 64) 256         conv0[0][0]                      
__________________________________________________________________________________________________
relu0 (Activation)              (None, 160, 320, 64) 0           bn0[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 162, 322, 64) 0           relu0[0][0]                      
__________________________________________________________________________________________________
pooling0 (MaxPooling2D)         (None, 80, 160, 64)  0           zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn1 (BatchNormaliz (None, 80, 160, 64)  256         pooling0[0][0]                   
__________________________________________________________________________________________________
stage1_unit1_relu1 (Activation) (None, 80, 160, 64)  0           stage1_unit1_bn1[0][0]           
__________________________________________________________________________________________________
stage1_unit1_conv1 (Conv2D)     (None, 80, 160, 64)  4096        stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_bn2 (BatchNormaliz (None, 80, 160, 64)  256         stage1_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_relu2 (Activation) (None, 80, 160, 64)  0           stage1_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 82, 162, 64)  0           stage1_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv2 (Conv2D)     (None, 80, 160, 64)  36864       zero_padding2d_3[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn3 (BatchNormaliz (None, 80, 160, 64)  256         stage1_unit1_conv2[0][0]         
__________________________________________________________________________________________________
stage1_unit1_relu3 (Activation) (None, 80, 160, 64)  0           stage1_unit1_bn3[0][0]           
__________________________________________________________________________________________________
stage1_unit1_conv3 (Conv2D)     (None, 80, 160, 256) 16384       stage1_unit1_relu3[0][0]         
__________________________________________________________________________________________________
stage1_unit1_sc (Conv2D)        (None, 80, 160, 256) 16384       stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_1 (Add)                     (None, 80, 160, 256) 0           stage1_unit1_conv3[0][0]         
                                                                 stage1_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage1_unit2_bn1 (BatchNormaliz (None, 80, 160, 256) 1024        add_1[0][0]                      
__________________________________________________________________________________________________
stage1_unit2_relu1 (Activation) (None, 80, 160, 256) 0           stage1_unit2_bn1[0][0]           
__________________________________________________________________________________________________
stage1_unit2_conv1 (Conv2D)     (None, 80, 160, 64)  16384       stage1_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_bn2 (BatchNormaliz (None, 80, 160, 64)  256         stage1_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_relu2 (Activation) (None, 80, 160, 64)  0           stage1_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 82, 162, 64)  0           stage1_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv2 (Conv2D)     (None, 80, 160, 64)  36864       zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
stage1_unit2_bn3 (BatchNormaliz (None, 80, 160, 64)  256         stage1_unit2_conv2[0][0]         
__________________________________________________________________________________________________
stage1_unit2_relu3 (Activation) (None, 80, 160, 64)  0           stage1_unit2_bn3[0][0]           
__________________________________________________________________________________________________
stage1_unit2_conv3 (Conv2D)     (None, 80, 160, 256) 16384       stage1_unit2_relu3[0][0]         
__________________________________________________________________________________________________
add_2 (Add)                     (None, 80, 160, 256) 0           stage1_unit2_conv3[0][0]         
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
stage1_unit3_bn1 (BatchNormaliz (None, 80, 160, 256) 1024        add_2[0][0]                      
__________________________________________________________________________________________________
stage1_unit3_relu1 (Activation) (None, 80, 160, 256) 0           stage1_unit3_bn1[0][0]           
__________________________________________________________________________________________________
stage1_unit3_conv1 (Conv2D)     (None, 80, 160, 64)  16384       stage1_unit3_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit3_bn2 (BatchNormaliz (None, 80, 160, 64)  256         stage1_unit3_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit3_relu2 (Activation) (None, 80, 160, 64)  0           stage1_unit3_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_5 (ZeroPadding2D (None, 82, 162, 64)  0           stage1_unit3_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit3_conv2 (Conv2D)     (None, 80, 160, 64)  36864       zero_padding2d_5[0][0]           
__________________________________________________________________________________________________
stage1_unit3_bn3 (BatchNormaliz (None, 80, 160, 64)  256         stage1_unit3_conv2[0][0]         
__________________________________________________________________________________________________
stage1_unit3_relu3 (Activation) (None, 80, 160, 64)  0           stage1_unit3_bn3[0][0]           
__________________________________________________________________________________________________
stage1_unit3_conv3 (Conv2D)     (None, 80, 160, 256) 16384       stage1_unit3_relu3[0][0]         
__________________________________________________________________________________________________
add_3 (Add)                     (None, 80, 160, 256) 0           stage1_unit3_conv3[0][0]         
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_bn1 (BatchNormaliz (None, 80, 160, 256) 1024        add_3[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_relu1 (Activation) (None, 80, 160, 256) 0           stage2_unit1_bn1[0][0]           
__________________________________________________________________________________________________
stage2_unit1_conv1 (Conv2D)     (None, 80, 160, 128) 32768       stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_bn2 (BatchNormaliz (None, 80, 160, 128) 512         stage2_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_relu2 (Activation) (None, 80, 160, 128) 0           stage2_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D (None, 82, 162, 128) 0           stage2_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv2 (Conv2D)     (None, 40, 80, 128)  147456      zero_padding2d_6[0][0]           
__________________________________________________________________________________________________
stage2_unit1_bn3 (BatchNormaliz (None, 40, 80, 128)  512         stage2_unit1_conv2[0][0]         
__________________________________________________________________________________________________
stage2_unit1_relu3 (Activation) (None, 40, 80, 128)  0           stage2_unit1_bn3[0][0]           
__________________________________________________________________________________________________
stage2_unit1_conv3 (Conv2D)     (None, 40, 80, 512)  65536       stage2_unit1_relu3[0][0]         
__________________________________________________________________________________________________
stage2_unit1_sc (Conv2D)        (None, 40, 80, 512)  131072      stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_4 (Add)                     (None, 40, 80, 512)  0           stage2_unit1_conv3[0][0]         
                                                                 stage2_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage2_unit2_bn1 (BatchNormaliz (None, 40, 80, 512)  2048        add_4[0][0]                      
__________________________________________________________________________________________________
stage2_unit2_relu1 (Activation) (None, 40, 80, 512)  0           stage2_unit2_bn1[0][0]           
__________________________________________________________________________________________________
stage2_unit2_conv1 (Conv2D)     (None, 40, 80, 128)  65536       stage2_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_bn2 (BatchNormaliz (None, 40, 80, 128)  512         stage2_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_relu2 (Activation) (None, 40, 80, 128)  0           stage2_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D (None, 42, 82, 128)  0           stage2_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv2 (Conv2D)     (None, 40, 80, 128)  147456      zero_padding2d_7[0][0]           
__________________________________________________________________________________________________
stage2_unit2_bn3 (BatchNormaliz (None, 40, 80, 128)  512         stage2_unit2_conv2[0][0]         
__________________________________________________________________________________________________
stage2_unit2_relu3 (Activation) (None, 40, 80, 128)  0           stage2_unit2_bn3[0][0]           
__________________________________________________________________________________________________
stage2_unit2_conv3 (Conv2D)     (None, 40, 80, 512)  65536       stage2_unit2_relu3[0][0]         
__________________________________________________________________________________________________
add_5 (Add)                     (None, 40, 80, 512)  0           stage2_unit2_conv3[0][0]         
                                                                 add_4[0][0]                      
__________________________________________________________________________________________________
stage2_unit3_bn1 (BatchNormaliz (None, 40, 80, 512)  2048        add_5[0][0]                      
__________________________________________________________________________________________________
stage2_unit3_relu1 (Activation) (None, 40, 80, 512)  0           stage2_unit3_bn1[0][0]           
__________________________________________________________________________________________________
stage2_unit3_conv1 (Conv2D)     (None, 40, 80, 128)  65536       stage2_unit3_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit3_bn2 (BatchNormaliz (None, 40, 80, 128)  512         stage2_unit3_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit3_relu2 (Activation) (None, 40, 80, 128)  0           stage2_unit3_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D (None, 42, 82, 128)  0           stage2_unit3_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit3_conv2 (Conv2D)     (None, 40, 80, 128)  147456      zero_padding2d_8[0][0]           
__________________________________________________________________________________________________
stage2_unit3_bn3 (BatchNormaliz (None, 40, 80, 128)  512         stage2_unit3_conv2[0][0]         
__________________________________________________________________________________________________
stage2_unit3_relu3 (Activation) (None, 40, 80, 128)  0           stage2_unit3_bn3[0][0]           
__________________________________________________________________________________________________
stage2_unit3_conv3 (Conv2D)     (None, 40, 80, 512)  65536       stage2_unit3_relu3[0][0]         
__________________________________________________________________________________________________
add_6 (Add)                     (None, 40, 80, 512)  0           stage2_unit3_conv3[0][0]         
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
stage2_unit4_bn1 (BatchNormaliz (None, 40, 80, 512)  2048        add_6[0][0]                      
__________________________________________________________________________________________________
stage2_unit4_relu1 (Activation) (None, 40, 80, 512)  0           stage2_unit4_bn1[0][0]           
__________________________________________________________________________________________________
stage2_unit4_conv1 (Conv2D)     (None, 40, 80, 128)  65536       stage2_unit4_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit4_bn2 (BatchNormaliz (None, 40, 80, 128)  512         stage2_unit4_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit4_relu2 (Activation) (None, 40, 80, 128)  0           stage2_unit4_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D (None, 42, 82, 128)  0           stage2_unit4_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit4_conv2 (Conv2D)     (None, 40, 80, 128)  147456      zero_padding2d_9[0][0]           
__________________________________________________________________________________________________
stage2_unit4_bn3 (BatchNormaliz (None, 40, 80, 128)  512         stage2_unit4_conv2[0][0]         
__________________________________________________________________________________________________
stage2_unit4_relu3 (Activation) (None, 40, 80, 128)  0           stage2_unit4_bn3[0][0]           
__________________________________________________________________________________________________
stage2_unit4_conv3 (Conv2D)     (None, 40, 80, 512)  65536       stage2_unit4_relu3[0][0]         
__________________________________________________________________________________________________
add_7 (Add)                     (None, 40, 80, 512)  0           stage2_unit4_conv3[0][0]         
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_bn1 (BatchNormaliz (None, 40, 80, 512)  2048        add_7[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_relu1 (Activation) (None, 40, 80, 512)  0           stage3_unit1_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit1_conv1 (Conv2D)     (None, 40, 80, 256)  131072      stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_bn2 (BatchNormaliz (None, 40, 80, 256)  1024        stage3_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_relu2 (Activation) (None, 40, 80, 256)  0           stage3_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2 (None, 42, 82, 256)  0           stage3_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv2 (Conv2D)     (None, 20, 40, 256)  589824      zero_padding2d_10[0][0]          
__________________________________________________________________________________________________
stage3_unit1_bn3 (BatchNormaliz (None, 20, 40, 256)  1024        stage3_unit1_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit1_relu3 (Activation) (None, 20, 40, 256)  0           stage3_unit1_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit1_conv3 (Conv2D)     (None, 20, 40, 1024) 262144      stage3_unit1_relu3[0][0]         
__________________________________________________________________________________________________
stage3_unit1_sc (Conv2D)        (None, 20, 40, 1024) 524288      stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_8 (Add)                     (None, 20, 40, 1024) 0           stage3_unit1_conv3[0][0]         
                                                                 stage3_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage3_unit2_bn1 (BatchNormaliz (None, 20, 40, 1024) 4096        add_8[0][0]                      
__________________________________________________________________________________________________
stage3_unit2_relu1 (Activation) (None, 20, 40, 1024) 0           stage3_unit2_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit2_conv1 (Conv2D)     (None, 20, 40, 256)  262144      stage3_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_bn2 (BatchNormaliz (None, 20, 40, 256)  1024        stage3_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_relu2 (Activation) (None, 20, 40, 256)  0           stage3_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_11 (ZeroPadding2 (None, 22, 42, 256)  0           stage3_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv2 (Conv2D)     (None, 20, 40, 256)  589824      zero_padding2d_11[0][0]          
__________________________________________________________________________________________________
stage3_unit2_bn3 (BatchNormaliz (None, 20, 40, 256)  1024        stage3_unit2_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit2_relu3 (Activation) (None, 20, 40, 256)  0           stage3_unit2_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit2_conv3 (Conv2D)     (None, 20, 40, 1024) 262144      stage3_unit2_relu3[0][0]         
__________________________________________________________________________________________________
add_9 (Add)                     (None, 20, 40, 1024) 0           stage3_unit2_conv3[0][0]         
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
stage3_unit3_bn1 (BatchNormaliz (None, 20, 40, 1024) 4096        add_9[0][0]                      
__________________________________________________________________________________________________
stage3_unit3_relu1 (Activation) (None, 20, 40, 1024) 0           stage3_unit3_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit3_conv1 (Conv2D)     (None, 20, 40, 256)  262144      stage3_unit3_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit3_bn2 (BatchNormaliz (None, 20, 40, 256)  1024        stage3_unit3_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit3_relu2 (Activation) (None, 20, 40, 256)  0           stage3_unit3_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_12 (ZeroPadding2 (None, 22, 42, 256)  0           stage3_unit3_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit3_conv2 (Conv2D)     (None, 20, 40, 256)  589824      zero_padding2d_12[0][0]          
__________________________________________________________________________________________________
stage3_unit3_bn3 (BatchNormaliz (None, 20, 40, 256)  1024        stage3_unit3_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit3_relu3 (Activation) (None, 20, 40, 256)  0           stage3_unit3_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit3_conv3 (Conv2D)     (None, 20, 40, 1024) 262144      stage3_unit3_relu3[0][0]         
__________________________________________________________________________________________________
add_10 (Add)                    (None, 20, 40, 1024) 0           stage3_unit3_conv3[0][0]         
                                                                 add_9[0][0]                      
__________________________________________________________________________________________________
stage3_unit4_bn1 (BatchNormaliz (None, 20, 40, 1024) 4096        add_10[0][0]                     
__________________________________________________________________________________________________
stage3_unit4_relu1 (Activation) (None, 20, 40, 1024) 0           stage3_unit4_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit4_conv1 (Conv2D)     (None, 20, 40, 256)  262144      stage3_unit4_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit4_bn2 (BatchNormaliz (None, 20, 40, 256)  1024        stage3_unit4_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit4_relu2 (Activation) (None, 20, 40, 256)  0           stage3_unit4_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, 22, 42, 256)  0           stage3_unit4_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit4_conv2 (Conv2D)     (None, 20, 40, 256)  589824      zero_padding2d_13[0][0]          
__________________________________________________________________________________________________
stage3_unit4_bn3 (BatchNormaliz (None, 20, 40, 256)  1024        stage3_unit4_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit4_relu3 (Activation) (None, 20, 40, 256)  0           stage3_unit4_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit4_conv3 (Conv2D)     (None, 20, 40, 1024) 262144      stage3_unit4_relu3[0][0]         
__________________________________________________________________________________________________
add_11 (Add)                    (None, 20, 40, 1024) 0           stage3_unit4_conv3[0][0]         
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
stage3_unit5_bn1 (BatchNormaliz (None, 20, 40, 1024) 4096        add_11[0][0]                     
__________________________________________________________________________________________________
stage3_unit5_relu1 (Activation) (None, 20, 40, 1024) 0           stage3_unit5_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit5_conv1 (Conv2D)     (None, 20, 40, 256)  262144      stage3_unit5_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit5_bn2 (BatchNormaliz (None, 20, 40, 256)  1024        stage3_unit5_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit5_relu2 (Activation) (None, 20, 40, 256)  0           stage3_unit5_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_14 (ZeroPadding2 (None, 22, 42, 256)  0           stage3_unit5_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit5_conv2 (Conv2D)     (None, 20, 40, 256)  589824      zero_padding2d_14[0][0]          
__________________________________________________________________________________________________
stage3_unit5_bn3 (BatchNormaliz (None, 20, 40, 256)  1024        stage3_unit5_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit5_relu3 (Activation) (None, 20, 40, 256)  0           stage3_unit5_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit5_conv3 (Conv2D)     (None, 20, 40, 1024) 262144      stage3_unit5_relu3[0][0]         
__________________________________________________________________________________________________
add_12 (Add)                    (None, 20, 40, 1024) 0           stage3_unit5_conv3[0][0]         
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
stage3_unit6_bn1 (BatchNormaliz (None, 20, 40, 1024) 4096        add_12[0][0]                     
__________________________________________________________________________________________________
stage3_unit6_relu1 (Activation) (None, 20, 40, 1024) 0           stage3_unit6_bn1[0][0]           
__________________________________________________________________________________________________
stage3_unit6_conv1 (Conv2D)     (None, 20, 40, 256)  262144      stage3_unit6_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit6_bn2 (BatchNormaliz (None, 20, 40, 256)  1024        stage3_unit6_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit6_relu2 (Activation) (None, 20, 40, 256)  0           stage3_unit6_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_15 (ZeroPadding2 (None, 22, 42, 256)  0           stage3_unit6_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit6_conv2 (Conv2D)     (None, 20, 40, 256)  589824      zero_padding2d_15[0][0]          
__________________________________________________________________________________________________
stage3_unit6_bn3 (BatchNormaliz (None, 20, 40, 256)  1024        stage3_unit6_conv2[0][0]         
__________________________________________________________________________________________________
stage3_unit6_relu3 (Activation) (None, 20, 40, 256)  0           stage3_unit6_bn3[0][0]           
__________________________________________________________________________________________________
stage3_unit6_conv3 (Conv2D)     (None, 20, 40, 1024) 262144      stage3_unit6_relu3[0][0]         
__________________________________________________________________________________________________
add_13 (Add)                    (None, 20, 40, 1024) 0           stage3_unit6_conv3[0][0]         
                                                                 add_12[0][0]                     
__________________________________________________________________________________________________
stage4_unit1_bn1 (BatchNormaliz (None, 20, 40, 1024) 4096        add_13[0][0]                     
__________________________________________________________________________________________________
stage4_unit1_relu1 (Activation) (None, 20, 40, 1024) 0           stage4_unit1_bn1[0][0]           
__________________________________________________________________________________________________
stage4_unit1_conv1 (Conv2D)     (None, 20, 40, 512)  524288      stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_bn2 (BatchNormaliz (None, 20, 40, 512)  2048        stage4_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_relu2 (Activation) (None, 20, 40, 512)  0           stage4_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_16 (ZeroPadding2 (None, 22, 42, 512)  0           stage4_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv2 (Conv2D)     (None, 10, 20, 512)  2359296     zero_padding2d_16[0][0]          
__________________________________________________________________________________________________
stage4_unit1_bn3 (BatchNormaliz (None, 10, 20, 512)  2048        stage4_unit1_conv2[0][0]         
__________________________________________________________________________________________________
stage4_unit1_relu3 (Activation) (None, 10, 20, 512)  0           stage4_unit1_bn3[0][0]           
__________________________________________________________________________________________________
stage4_unit1_conv3 (Conv2D)     (None, 10, 20, 2048) 1048576     stage4_unit1_relu3[0][0]         
__________________________________________________________________________________________________
stage4_unit1_sc (Conv2D)        (None, 10, 20, 2048) 2097152     stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_14 (Add)                    (None, 10, 20, 2048) 0           stage4_unit1_conv3[0][0]         
                                                                 stage4_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage4_unit2_bn1 (BatchNormaliz (None, 10, 20, 2048) 8192        add_14[0][0]                     
__________________________________________________________________________________________________
stage4_unit2_relu1 (Activation) (None, 10, 20, 2048) 0           stage4_unit2_bn1[0][0]           
__________________________________________________________________________________________________
stage4_unit2_conv1 (Conv2D)     (None, 10, 20, 512)  1048576     stage4_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_bn2 (BatchNormaliz (None, 10, 20, 512)  2048        stage4_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_relu2 (Activation) (None, 10, 20, 512)  0           stage4_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_17 (ZeroPadding2 (None, 12, 22, 512)  0           stage4_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv2 (Conv2D)     (None, 10, 20, 512)  2359296     zero_padding2d_17[0][0]          
__________________________________________________________________________________________________
stage4_unit2_bn3 (BatchNormaliz (None, 10, 20, 512)  2048        stage4_unit2_conv2[0][0]         
__________________________________________________________________________________________________
stage4_unit2_relu3 (Activation) (None, 10, 20, 512)  0           stage4_unit2_bn3[0][0]           
__________________________________________________________________________________________________
stage4_unit2_conv3 (Conv2D)     (None, 10, 20, 2048) 1048576     stage4_unit2_relu3[0][0]         
__________________________________________________________________________________________________
add_15 (Add)                    (None, 10, 20, 2048) 0           stage4_unit2_conv3[0][0]         
                                                                 add_14[0][0]                     
__________________________________________________________________________________________________
stage4_unit3_bn1 (BatchNormaliz (None, 10, 20, 2048) 8192        add_15[0][0]                     
__________________________________________________________________________________________________
stage4_unit3_relu1 (Activation) (None, 10, 20, 2048) 0           stage4_unit3_bn1[0][0]           
__________________________________________________________________________________________________
stage4_unit3_conv1 (Conv2D)     (None, 10, 20, 512)  1048576     stage4_unit3_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit3_bn2 (BatchNormaliz (None, 10, 20, 512)  2048        stage4_unit3_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit3_relu2 (Activation) (None, 10, 20, 512)  0           stage4_unit3_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_18 (ZeroPadding2 (None, 12, 22, 512)  0           stage4_unit3_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit3_conv2 (Conv2D)     (None, 10, 20, 512)  2359296     zero_padding2d_18[0][0]          
__________________________________________________________________________________________________
stage4_unit3_bn3 (BatchNormaliz (None, 10, 20, 512)  2048        stage4_unit3_conv2[0][0]         
__________________________________________________________________________________________________
stage4_unit3_relu3 (Activation) (None, 10, 20, 512)  0           stage4_unit3_bn3[0][0]           
__________________________________________________________________________________________________
stage4_unit3_conv3 (Conv2D)     (None, 10, 20, 2048) 1048576     stage4_unit3_relu3[0][0]         
__________________________________________________________________________________________________
add_16 (Add)                    (None, 10, 20, 2048) 0           stage4_unit3_conv3[0][0]         
                                                                 add_15[0][0]                     
__________________________________________________________________________________________________
bn1 (BatchNormalization)        (None, 10, 20, 2048) 8192        add_16[0][0]                     
__________________________________________________________________________________________________
relu1 (Activation)              (None, 10, 20, 2048) 0           bn1[0][0]                        
__________________________________________________________________________________________________
decoder_stage0a_conv (Conv2D)   (None, 10, 20, 512)  1048576     relu1[0][0]                      
__________________________________________________________________________________________________
decoder_stage0a_bn (BatchNormal (None, 10, 20, 512)  2048        decoder_stage0a_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage0a_relu (Activatio (None, 10, 20, 512)  0           decoder_stage0a_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage0_upsampling (UpSa (None, 20, 40, 512)  0           decoder_stage0a_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage0b_conv (Conv2D)   (None, 20, 40, 512)  2359296     decoder_stage0_upsampling[0][0]  
__________________________________________________________________________________________________
decoder_stage0b_bn (BatchNormal (None, 20, 40, 512)  2048        decoder_stage0b_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage0b_relu (Activatio (None, 20, 40, 512)  0           decoder_stage0b_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage0c_conv (Conv2D)   (None, 20, 40, 1024) 524288      decoder_stage0b_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage0c_bn (BatchNormal (None, 20, 40, 1024) 4096        decoder_stage0c_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage0c_relu (Activatio (None, 20, 40, 1024) 0           decoder_stage0c_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage0_add (Add)        (None, 20, 40, 1024) 0           decoder_stage0c_relu[0][0]       
                                                                 stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage1a_conv (Conv2D)   (None, 20, 40, 256)  262144      decoder_stage0_add[0][0]         
__________________________________________________________________________________________________
decoder_stage1a_bn (BatchNormal (None, 20, 40, 256)  1024        decoder_stage1a_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage1a_relu (Activatio (None, 20, 40, 256)  0           decoder_stage1a_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage1_upsampling (UpSa (None, 40, 80, 256)  0           decoder_stage1a_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage1b_conv (Conv2D)   (None, 40, 80, 256)  589824      decoder_stage1_upsampling[0][0]  
__________________________________________________________________________________________________
decoder_stage1b_bn (BatchNormal (None, 40, 80, 256)  1024        decoder_stage1b_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage1b_relu (Activatio (None, 40, 80, 256)  0           decoder_stage1b_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage1c_conv (Conv2D)   (None, 40, 80, 512)  131072      decoder_stage1b_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage1c_bn (BatchNormal (None, 40, 80, 512)  2048        decoder_stage1c_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage1c_relu (Activatio (None, 40, 80, 512)  0           decoder_stage1c_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage1_add (Add)        (None, 40, 80, 512)  0           decoder_stage1c_relu[0][0]       
                                                                 stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage2a_conv (Conv2D)   (None, 40, 80, 128)  65536       decoder_stage1_add[0][0]         
__________________________________________________________________________________________________
decoder_stage2a_bn (BatchNormal (None, 40, 80, 128)  512         decoder_stage2a_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage2a_relu (Activatio (None, 40, 80, 128)  0           decoder_stage2a_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage2_upsampling (UpSa (None, 80, 160, 128) 0           decoder_stage2a_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage2b_conv (Conv2D)   (None, 80, 160, 128) 147456      decoder_stage2_upsampling[0][0]  
__________________________________________________________________________________________________
decoder_stage2b_bn (BatchNormal (None, 80, 160, 128) 512         decoder_stage2b_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage2b_relu (Activatio (None, 80, 160, 128) 0           decoder_stage2b_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage2c_conv (Conv2D)   (None, 80, 160, 256) 32768       decoder_stage2b_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage2c_bn (BatchNormal (None, 80, 160, 256) 1024        decoder_stage2c_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage2c_relu (Activatio (None, 80, 160, 256) 0           decoder_stage2c_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage2_add (Add)        (None, 80, 160, 256) 0           decoder_stage2c_relu[0][0]       
                                                                 stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage3a_conv (Conv2D)   (None, 80, 160, 64)  16384       decoder_stage2_add[0][0]         
__________________________________________________________________________________________________
decoder_stage3a_bn (BatchNormal (None, 80, 160, 64)  256         decoder_stage3a_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage3a_relu (Activatio (None, 80, 160, 64)  0           decoder_stage3a_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage3_upsampling (UpSa (None, 160, 320, 64) 0           decoder_stage3a_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage3b_conv (Conv2D)   (None, 160, 320, 64) 36864       decoder_stage3_upsampling[0][0]  
__________________________________________________________________________________________________
decoder_stage3b_bn (BatchNormal (None, 160, 320, 64) 256         decoder_stage3b_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage3b_relu (Activatio (None, 160, 320, 64) 0           decoder_stage3b_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage3c_conv (Conv2D)   (None, 160, 320, 64) 4096        decoder_stage3b_relu[0][0]       
__________________________________________________________________________________________________
decoder_stage3c_bn (BatchNormal (None, 160, 320, 64) 256         decoder_stage3c_conv[0][0]       
__________________________________________________________________________________________________
decoder_stage3c_relu (Activatio (None, 160, 320, 64) 0           decoder_stage3c_bn[0][0]         
__________________________________________________________________________________________________
decoder_stage3_add (Add)        (None, 160, 320, 64) 0           decoder_stage3c_relu[0][0]       
                                                                 relu0[0][0]                      
__________________________________________________________________________________________________
decoder_stage4a_conv (Conv2D)   (None, 160, 320, 16) 1024        decoder_stage3_add[0][0]         
__________________________________________________________________________________________________
decoder_stage4a_bn (BatchNormal (None, 160, 320, 16) 64          decoder_stage4a_conv[0][0]       